//: [Previous](@previous)


/*
 Массивы:
 1. Сумма элементов: Напишите программу, которая принимает массив чисел и возвращает их сумму.
 2. Обратный массив: Создайте программу, которая принимает массив и возвращает его в обратном порядке.
 
 Словари:
 1. Смена ключей и значений: Напишите программу, которая принимает словарь и возвращает новый словарь, где ключи становятся значениями и наоборот.
 2. Объединение словарей: Создайте программу, которая принимает два словаря и объединяет их в один. В случае совпадения ключей, значения должны складываться.
 
 Множества:
 1. Уникальные элементы: Напишите программу, которая принимает массив и возвращает множество из уникальных элементов этого массива.
 2. Подмножества: Напишите программу, которая проверяет, является ли одно множество подмножеством другого.
 */

/*
 Массивы:
 - Поиск минимума и максимума: Найдите минимальное и максимальное значение в массиве.
 - Четные и нечетные: Разделите массив на два: один с четными числами, другой с нечетными.
 - Дан массив чисел. Найдите все уникальные элементы этого массива. (два решения, одно с использованием множеств, другое без множеств)
 
 Словари:
 - Инвертирование словаря: Дан словарь. Создайте новый словарь, где ключи становятся значениями, а значения ключами.
 - Фильтрация по значению: Напишите программу, которая принимает словарь и фильтрует его по определенному (придумайте сими) условию значений.
 
 Множества (два решения, одно с использованием спец методов рассмотренных на уроке, другое без них, вручную с помощью циклов и условий):
 - Объединение множеств: Создайте два множества и найдите их объединение.
 - Разность множеств: Создайте два множества и найдите разность между ними (т.е. элементы, которые есть в первом множестве, но нет во втором).
 - Создайте два множества и найдите их пересечение.
 */
//: [Next](@next)
