//: [Previous](@previous)
/*
 
 ### Условный оператор `if`
 1. **Проверка четности**: Напишите код, который проверяет, является ли число четным или нечетным.
 2. **Температура**: Если температура ниже 0, выведите "Холодно". Если выше 30, выведите "Жарко".
 
 ### Тернарный оператор `?:`
 1. **Минимум из двух чисел**: Найдите минимальное из двух чисел без использования `if`.
 2. **Строковый регистр**: Преобразуйте строку в верхний регистр, если она короче 5 символов, иначе в нижний.
 
 ### Оператор выбора `switch`
 1. **Дни недели**: Выведите название дня недели по его номеру.
 2. **Оценки**: Преобразуйте числовую оценку в буквенную (A, B, C, D, F).
 
 ### Оператор цикла `for`
 1. **Факториал**: Вычислите факториал числа.
 2. **Таблица умножения**: Выведите таблицу умножения для выбранного числа.
 
 ### Операторы `while`, `repeat-while`
 1. **Сумма чисел**: Найдите сумму чисел от 1 до N.
 2. **Поиск делителя**: Найдите первый делитель числа, отличный от 1 и самого числа.
 
 ### Операторы `break`, `continue`
 1. **Пропуск четных чисел**: В цикле от 1 до 10 пропустите четные числа.
 2. **Досрочный выход**: В цикле поиска делителя (из предыдущего раздела) выходите из цикла, как только найдете делитель.
 
 */
//: [Next](@next)
