//: [Previous](@previous)

import Foundation


// упрощеённые вырианты заданий

/*
 
 1. Дни недели: Создайте enum для дней недели и метод, который определяет, является ли день выходным или рабочим.
 2. Типы Кофе: Создайте enum для несокльких типов кофе и чая. Добавьте код, который выводит цену для каждого типа.
 3. Статус Заказа: Используйте enum: (в обработке, отправлен, доставлен и т.д.)
 4. Математические Операции: Создайте enum для арифметических операций (+, -, *, /) и код, который принимает два числа и enum операции, выполняя эту операцию.
 5. Типы Погоды: Создайте enum для разных типов погоды (ясно, облачно, дождь и т.д.). Добавьте метод, который возвращает рекомендацию по одежде.
 */


// полные варианты заданий
/*
 1. Типы Кофе: Создайте enum для несокльких типов кофе и чая. Для каждого напитка должна быть возможность добавить два значения - температуру и время заваривания. Добавьте код, который выводит цену для каждого типа.
 2. Статус Заказа: Используйте enum с ассоциированными значениями для статусов заказа напитков из предыдущего задания: в обработке, отправлен, доставлен и т.д. 
 3. Статус Доставки: Описать статус доставки заказа, получаемый от сервера в виде числового кода. Вывести на экран человеко-читаемое сообщение.
 */
//: [Next](@next)
