//: [Previous](@previous)

import Foundation

/*
 1. напишите функцию, которая выполняет один из двух, предварительно созданных кложуров, в зависимости от переданного в неё пареметра.
 2. напишите функцию, которая возвращает кложур, для возведения числа в степень, как результат.
 3. напишите функцию, которая принимает массив чисел и возвращает новый массив, содержащий отфильтрованные числа. Используйте замыкание в качестве параметра функции, чтобы проверять условие фильтраци.
 */
//: [Next](@next)
