//: [Previous](@previous)

/*
 
 1. **Сумма элементов**: Напишите функцию, которая принимает массив чисел и возвращает их сумму.
 2. **Минимум и максимум**: Напишите функцию, которая возвращает кортеж с минимальным и максимальным значениями в массиве.
 3. **Подсчет слов**: Напишите функцию, которая принимает строку и возвращает словарь с количеством каждого слова в строке. можно использовать text.split(separator: " ").
 4. **Обмен валют**: Создайте функцию, которая принимает сумму в долларах и словарь с курсами валют, возвращая сумму в других валютах.
 5. **Статус заказа**: Создайте перечисление с разными статусами заказа (enum новый, в обработке, выполнен) и функцию, которая принимает статус и возвращает описание.
 6. **Дни недели**: Создайте перечисление для дней недели и функцию, которая принимает день и возвращает, является ли он выходным.
 7. **Безопасный доступ**: Напишите функцию, которая принимает опциональную строку и возвращает её длину, если строка не `nil`.
 8. **Поиск элемента**: Создайте функцию, которая ищет элемент в массиве и возвращает его индекс как опционал.
 9. **Координаты**: Создайте функцию, которая принимает кортеж с координатами (x, y) и возвращает расстояние от начала координат. Используем стандартные функции sqrt (корень) и pow(степень). Формула расстояния - корень из суммы квадратов координат.
 10. Создайте функцию, которая принимает массив кортежей. Каждый кортеж содержит имя студента (строка) и его оценку (целое число). Функция должна возвращать два кортежа: первый с именем студента с наивысшей оценкой и самой оценкой, второй — с наименьшей.
 
 */




//: [Next](@next)
