//: [Previous](@previous)

import Foundation

var greeting = "Hello, класс"


/*
 
 1. Создайте класс Person, который содержит свойства name, age, gender. Определите значения по умолчанию для некоторых из свойств. Добавить инициализатор. Класс так же должен содержать метод getDescription, который возвращает предложение со всей информацией о персоне. Создайте экземпляр класса, и задайте конкретные значения для свойств. Отобразите результат работы метода getDescription на консоли.
 
 2. Создайте класс BankAccount, который будет содержать свойства balance и accountNumber. Создайте методы increaseDeposit и withdrawMoney, первый будет добавлять к балансу какую-то сумму, а второй уменьшать ее. Добавить инициализатор. Добавить вычисляемые свойство getDescription для получения описания объекта.
 
 */
//: [Next](@next)
